# PythonGetSearchPath

## Description
Return the search path for python files.

```pascal
FUNCTION PythonGetSearchPath : DYNARRAY[] of CHAR;
```

```python
def vs.PythonGetSearchPath():
    return DYNARRAY[] of CHAR
```

## See Also
VS Functions:
PythonSetSearchPath
| PythonExecute

## Version
Availability: from Vectorworks 2014

## Category
* Utility